---
kind: enumMember
id: F:Autodesk.Revit.DB.Events.DataTransferMode.Upload
enum: Autodesk.Revit.DB.Events.DataTransferMode
source: html/970e779d-cfc8-9b58-eb88-bf23df21477c.htm
---
# Autodesk.Revit.DB.Events.DataTransferMode.Upload

Transfer data from client to server.